# ╭──────────────────────────────────────────────────────────╮
# │ brew bundle command                                      │
# ╰──────────────────────────────────────────────────────────╯
# add extra repositories other than the default one 
tap "homebrew/bundle" || true 
tap "TheZoraiz/ascii-image-converter"

# ╭──────────────────────────────────────────────────────────╮
# │ neovim text editor                                       │
# ╰──────────────────────────────────────────────────────────╯
## Ambitious Vim-fork focused on extensibility and agility
## use `nvim` to launch the editor
# tap "neovim/neovim" || true
## Ambitious Vim-fork focused on extensibility and agility
brew "neovim", head: "true"
## Post-modern modal text editor
# brew "helix"

# ╭──────────────────────────────────────────────────────────╮
# │ python environments                                      │
# ╰──────────────────────────────────────────────────────────╯
# brew "pyenv" # replaced by the uv package manager written in Rust
brew "pipenv"
brew "pipx"

# ╭──────────────────────────────────────────────────────────╮
# │ other programming languages                              │
# ╰──────────────────────────────────────────────────────────╯
brew "node" #node.js
brew "openjdk" #java
brew "rust" #rust
brew "go" #golang

# ╭──────────────────────────────────────────────────────────╮
# │ yazi and its dependencies                                │
# ╰──────────────────────────────────────────────────────────╯
## yazi file manager 
brew "yazi" 
## Create thumbnails for your video files
brew "ffmpegthumbnailer" 
## Play, record, convert, and stream audio and video
brew "ffmpeg"
## 7-Zip is a file archiver with a high compression ratio 
brew "sevenzip" 
## lightweight and flexible command-line json processor
brew "jq" 
## PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler" 
## Simple, fast and user-friendly alternative to find 
brew "fd" 
## Search tool like grep and The Silver Searcher 
brew "ripgrep" 
## Command-line fuzzy finder written in Go
brew "fzf" 
## Shell extension to navigate your filesystem faster
brew "zoxide" 
## tools and libraries to manipulate images in many formats
brew "imagemagick" 

# ╭──────────────────────────────────────────────────────────╮
# │ shells                                                   │
# ╰──────────────────────────────────────────────────────────╯
## Hackable, minimal, fast TUI file explorer
# brew "xplr"
## file browser
# brew "ranger"

# ╭──────────────────────────────────────────────────────────╮
# │ other tools                                              │
# ╰──────────────────────────────────────────────────────────╯
## suite of command-line tools for converting to and working with csv
# brew "csvkit"
## All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
## Easily create and use cli based on bash script
brew "argc"
## Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
## Modern, maintained replacement for ls
brew "eza"
## like neofetch, but much faster because written mostly in c
brew "fastfetch"
## distributed revision control system
brew "git"
## Blazing fast terminal-ui for git written in rust
brew "gitui"
## simple terminal ui for git commands
# brew "lazygit"
## command-line toolbox for fancy output in the terminal
brew "rich-cli"
## cross-shell prompt for astronauts
brew "starship"
## organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
## Terminal image and video viewer
# brew "timg"
## simplified and community-driven man pages
brew "tldr"
## display directories as trees (with optional color/html output)
brew "tree"
## pluggable terminal workspace, with terminal multiplexer as the base feature
# brew "zellij"
## Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
## Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
## Convert images to ascii art
brew "ascii-image-converter"
## Terminal based presentation tool
brew "slides"
## Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
## Pager/text based browser
brew "w3m"
## Terminal slideshow tool, the export2pdf function doesn't work!
# brew "presenterm"
## Terminal multiplexer
# brew "tmux"
## Toolkit for creating graphical user interfaces
# brew "gtk+3"
## Single-player roguelike video game
brew "nethack"

# ╭──────────────────────────────────────────────────────────╮
# │ cask applications                                        │
# ╰──────────────────────────────────────────────────────────╯
# specify a directory to install the applications in
cask_args appdir: '/Applications'
## Menlo for Powerline 
cask "font-hack-nerd-font"
## Symbols Nerd Font (Symbols Only)
cask "font-symbols-only-nerd-font"
## Terminal emulator as alternative to Apple's Terminal app
# cask "iterm2"
## GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
## Get up and running with large language models locally
cask "ollama"
